; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-13)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 )
(:init
(on b1 b3)
(on b2 b11)
(on b3 b2)
(on b4 b5)
(on b5 b13)
(on b6 b10)
(on b7 b6)
(ontable b8)
(on b9 b4)
(ontable b10)
(ontable b11)
(on b12 b1)
(on b13 b12)
(clear b7)
(clear b8)
(clear b9)
)
(:goal
(and
(on b1 b5)
(on b2 b12)
(on b3 b13)
(on b5 b2)
(on b6 b8)
(on b7 b1)
(on b8 b3)
(on b9 b11)
(on b11 b4)
(on b12 b6))
)
)

; plan
1. (move-b-to-t b9 b4)
   deleted: (on b9 b4)
   added: (ontable b9) (clear b4)
   goals met: 0 of 10
2. (move-b-to-t b4 b5)
   deleted: (on b4 b5)
   added: (ontable b4) (clear b5)
   goals met: 0 of 10
3. (move-b-to-b b5 b13 b9)
   deleted: (clear b9) (on b5 b13)
   added: (on b5 b9) (clear b13)
   goals met: 0 of 10
4. (move-b-to-t b13 b12)
   deleted: (on b13 b12)
   added: (ontable b13) (clear b12)
   goals met: 0 of 10
5. (move-b-to-b b12 b1 b5)
   deleted: (clear b5) (on b12 b1)
   added: (on b12 b5) (clear b1)
   goals met: 0 of 10
6. (move-b-to-b b1 b3 b4)
   deleted: (clear b4) (on b1 b3)
   added: (on b1 b4) (clear b3)
   goals met: 0 of 10
7. (move-b-to-b b3 b2 b13)
   deleted: (clear b13) (on b3 b2)
   added: (on b3 b13) (clear b2)
   goals met: 1 of 10
8. (move-t-to-b b8 b3)
   deleted: (clear b3) (ontable b8)
   added: (on b8 b3)
   goals met: 2 of 10
9. (move-b-to-t b7 b6)
   deleted: (on b7 b6)
   added: (ontable b7) (clear b6)
   goals met: 2 of 10
10. (move-b-to-b b6 b10 b8)
   deleted: (clear b8) (on b6 b10)
   added: (on b6 b8) (clear b10)
   goals met: 3 of 10
11. (move-b-to-b b12 b5 b6)
   deleted: (clear b6) (on b12 b5)
   added: (on b12 b6) (clear b5)
   goals met: 4 of 10
12. (move-b-to-b b2 b11 b12)
   deleted: (clear b12) (on b2 b11)
   added: (on b2 b12) (clear b11)
   goals met: 5 of 10
13. (move-b-to-b b5 b9 b2)
   deleted: (clear b2) (on b5 b9)
   added: (on b5 b2) (clear b9)
   goals met: 6 of 10
14. (move-b-to-b b1 b4 b5)
   deleted: (clear b5) (on b1 b4)
   added: (on b1 b5) (clear b4)
   goals met: 7 of 10
15. (move-t-to-b b11 b4)
   deleted: (clear b4) (ontable b11)
   added: (on b11 b4)
   goals met: 8 of 10
16. (move-t-to-b b7 b1)
   deleted: (clear b1) (ontable b7)
   added: (on b7 b1)
   goals met: 9 of 10
17. (move-t-to-b b9 b11)
   deleted: (clear b11) (ontable b9)
   added: (on b9 b11)
   goals met: 10 of 10
